Learn basic Pandas with AlgoAddict
- study the US natural parks data

In [2]:
# import library

import pandas as pd

In [3]:
# read csv file and save to a dataframe named park_df

park_df = pd.read_csv('data_us_national_parks/parks.csv', index_col = ['Park Code'])
park_df.head(3)

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [4]:
# use .iloc to access data by index number - starting with index 0

park_df.iloc[2]

Park Name    Badlands National Park
State                            SD
Acres                        242756
Latitude                      43.75
Longitude                    -102.5
Name: BADL, dtype: object

In [5]:
# use .loc to access data by index name

park_df.loc['ARCH']

Park Name    Arches National Park
State                          UT
Acres                       76519
Latitude                    38.68
Longitude                 -109.57
Name: ARCH, dtype: object

In [6]:
# access data more than 2 rows

park_df.loc[['ACAD', 'BADL']]

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [7]:
park_df.iloc[[1, 2]]

                        Park Name State   Acres  Latitude  Longitude
Park Code
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [8]:
park_df.iloc[2:4] # will ger row 2 and 3 bcs it is excluded row # 4

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
BIBE       Big Bend National Park    TX  801163     29.25    -103.25

In [9]:
park_df.head()

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50
BIBE       Big Bend National Park    TX  801163     29.25    -103.25
BISC       Biscayne National Park    FL  172924     25.65     -80.08

In [10]:
# access column's data

park_df.State.head(3)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: State, dtype: object

In [11]:
park_df['State'].head(3)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: State, dtype: object

In [12]:
# define column name to be same format

def clean_colName(df):

    df.columns = [col.replace(' ', '_').lower() for col in df.columns]
    return df

In [13]:
park_df.head(3)

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [14]:
park_df = clean_colName(park_df)
park_df.head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [15]:
# access data by set both column and row

park_df[['state', 'acres']][:3]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

In [16]:
# access data using condition

park_df[park_df.state == 'UT']

                            park_name state   acres  latitude  longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93
CARE       Capitol Reef National Park    UT  241904     38.20    -111.17
ZION               Zion National Park    UT  146598     37.30    -113.05

In [17]:
park_df[(park_df.state == 'UT') & (park_df.acres > 10**5)]

                            park_name state   acres  latitude  longitude
Park Code
CANY        Canyonlands National Park    UT  337598      38.2    -109.93
CARE       Capitol Reef National Park    UT  241904      38.2    -111.17
ZION               Zion National Park    UT  146598      37.3    -113.05

In [18]:
# check how many state are in the dataframe

park_df['state'].unique()

array(['ME', 'UT', 'SD', 'TX', 'FL', 'CO', 'NM', 'CA', 'SC', 'OR', 'OH',
       'AK', 'CA, NV', 'MT', 'NV', 'AZ', 'TN, NC', 'WY', 'HI', 'AR', 'MI',
       'KY', 'WA', 'VA', 'ND', 'MN', 'WY, MT, ID'], dtype=object)

In [19]:
len(park_df['state'].unique())

27

In [20]:
# check how may parks are in the dataframe

park_df['park_name'].unique()

array(['Acadia National Park', 'Arches National Park',
       'Badlands National Park', 'Big Bend National Park',
       'Biscayne National Park',
       'Black Canyon of the Gunnison National Park',
       'Bryce Canyon National Park', 'Canyonlands National Park',
       'Capitol Reef National Park', 'Carlsbad Caverns National Park',
       'Channel Islands National Park', 'Congaree National Park',
       'Crater Lake National Park', 'Cuyahoga Valley National Park',
       'Denali National Park and Preserve', 'Death Valley National Park',
       'Dry Tortugas National Park', 'Everglades National Park',
       'Gates Of The Arctic National Park and Preserve',
       'Glacier National Park', 'Glacier Bay National Park and Preserve',
       'Great Basin National Park', 'Grand Canyon National Park',
       'Great Sand Dunes National Park and Preserve',
       'Great Smoky Mountains National Park', 'Grand Teton National Park',
       'Guadalupe Mountains National Park', 'Haleakala National Park',
       'Hawaii Volcanoes National Park', 'Hot Springs National Park',
       'Isle Royale National Park', 'Joshua Tree National Park',
       'Katmai National Park and Preserve', 'Kenai Fjords National Park',
       'Kobuk Valley National Park',
       'Lake Clark National Park and Preserve',
       'Lassen Volcanic National Park', 'Mammoth Cave National Park',
       'Mesa Verde National Park', 'Mount Rainier National Park',
       'North Cascades National Park', 'Olympic National Park',
       'Petrified Forest National Park', 'Pinnacles National Park',
       'Redwood National Park', 'Rocky Mountain National Park',
       'Saguaro National Park', 'Sequoia and Kings Canyon National Parks',
       'Shenandoah National Park', 'Theodore Roosevelt National Park',
       'Voyageurs National Park', 'Wind Cave National Park',
       'Wrangell - St Elias National Park and Preserve',
       'Yellowstone National Park', 'Yosemite National Park',
       'Zion National Park'], dtype=object)

In [21]:
len(park_df['park_name'].unique())

56

In [22]:
# find min and max area

park_df['acres'].min(), park_df['acres'].max()

(5550, 8323148)

In [26]:
park_df[park_df['acres'] == 8323148]

,park_name,state,acres,latitude,longitude
Park Code,,,,,
WRST,Wrangell - St Elias National Park and Preserve,AK,8323148,61.0,-142.0

In [27]:
park_df[(park_df['acres'] == 5550) | (park_df['acres'] == 8323148)]

,park_name,state,acres,latitude,longitude
Park Code,,,,,
HOSP,Hot Springs National Park,AR,5550,34.51,-93.05
WRST,Wrangell - St Elias National Park and Preserve,AK,8323148,61.00,-142.00